In [128]:
import numpy as np
import pandas as pd

In [175]:
data={"subject":["math","hist","science","wf"],
     "marks":(1,2,3,4),
     "points":(32,4312,5436,2)}

In [177]:
df=pd.DataFrame(data)

In [270]:
df

   subject  marks  points
0     math      1      32
1     hist      1    4312
2  science      3    5436
3       wf      4       2

In [281]:
# create series
a = pd.Series([101,102,103,104,105,106])
b = pd.Series([107,108,109,110,111,112])

In [294]:
c=pd.concat([a,b],axis=1,keys=["a","b"])
c

     a    b
0  101  107
1  102  108
2  103  109
3  104  110
4  105  111
5  106  112

In [301]:
d=pd.DataFrame(a,index=["a"])
d

    0
a NaN

In [304]:
a=np.arange(20)
a.reshape(4,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [326]:
a=[1,2,3]
b=[3,4,5]

In [356]:
data = pd.read_csv("example.csv")
data

    Age  Weight (in kg)  Height (in m)
0    45              60           1.35
1    12              43           1.21
2    54              78           1.50
3    26              65           1.21
4    68              50           1.32
5    21              43           1.52
6    10              32           1.65
7    57              34           1.61
8    75              23           1.24
9    32              21           1.52
10   23              53           1.50
11   34              65           1.76
12   55              89           1.65
13   23              45           1.75
14   56              76           1.69
15   67              78           1.85
16   26              65           1.21
17   56              74           1.69
18   67              78           1.85
19   26              65           1.21
20   68              50           1.32
21   56              76           1.69
22   67              78           1.85

In [357]:
data["nowe"]=data["Age"]/2
data

    Age  Weight (in kg)  Height (in m)  nowe
0    45              60           1.35  22.5
1    12              43           1.21   6.0
2    54              78           1.50  27.0
3    26              65           1.21  13.0
4    68              50           1.32  34.0
5    21              43           1.52  10.5
6    10              32           1.65   5.0
7    57              34           1.61  28.5
8    75              23           1.24  37.5
9    32              21           1.52  16.0
10   23              53           1.50  11.5
11   34              65           1.76  17.0
12   55              89           1.65  27.5
13   23              45           1.75  11.5
14   56              76           1.69  28.0
15   67              78           1.85  33.5
16   26              65           1.21  13.0
17   56              74           1.69  28.0
18   67              78           1.85  33.5
19   26              65           1.21  13.0
20   68              50           1.32  34.0
21   56              76           1.69  28.0
22   67              78           1.85  33.5

In [363]:
data[np.logical_or.reduce([data<3, data==5])]

    Age  Weight (in kg)  Height (in m)  nowe
0    45              60           1.35  22.5
1    12              43           1.21   6.0
2    54              78           1.50  27.0
3    26              65           1.21  13.0
4    68              50           1.32  34.0
5    21              43           1.52  10.5
6    10              32           1.65   5.0
6    10              32           1.65   5.0
7    57              34           1.61  28.5
8    75              23           1.24  37.5
9    32              21           1.52  16.0
10   23              53           1.50  11.5
11   34              65           1.76  17.0
12   55              89           1.65  27.5
13   23              45           1.75  11.5
14   56              76           1.69  28.0
15   67              78           1.85  33.5
16   26              65           1.21  13.0
17   56              74           1.69  28.0
18   67              78           1.85  33.5
19   26              65           1.21  13.0
20   68              50           1.32  34.0
21   56              76           1.69  28.0
22   67              78           1.85  33.5

In [422]:
# create series
a = pd.Series([101,102,103,104,105,106])
b = pd.Series([107,108,109,110,111,112])

In [374]:
c=pd.concat([a,b],axis=1)
c

     0    1
0  101  107
1  102  108
2  103  109
3  104  110
4  105  111
5  106  112

In [379]:
c.columns=(["a","b"])

In [381]:
c

     a    b
0  101  107
1  102  108
2  103  109
3  104  110
4  105  111
5  106  112

In [423]:
df1=pd.DataFrame({
 'Product_ID':[101,102,103,104,105,106],
 'Food_Product':['Cakes','Biscuits','Fruit','Beverages','Cakes','Beverages'],
 'Brand':['Baskin Robbins','Blue Riband','Peach','Horlicks','Mars Muffin','Mirinda'], 
})


df2=pd.DataFrame({
 'Product_ID':[104,102,101,103,107,108],
 'Food_Product':['Beverages', 'Biscuits', 'Cakes', 'Fruit', 'Breakfast foods', 'Chips'],
  'Brand':['Coca-Cola', 'Oreo', 'Dunkin Donuts', 'Banana', 'Cream of Wheat', 'Cheetos']  
})

In [426]:
df1

   Product_ID Food_Product           Brand
0         101        Cakes  Baskin Robbins
1         102     Biscuits     Blue Riband
2         103        Fruit           Peach
3         104    Beverages        Horlicks
4         105        Cakes     Mars Muffin
5         106    Beverages         Mirinda

In [425]:
df2

   Product_ID     Food_Product           Brand
0         104        Beverages       Coca-Cola
1         102         Biscuits            Oreo
2         101            Cakes   Dunkin Donuts
3         103            Fruit          Banana
4         107  Breakfast foods  Cream of Wheat
5         108            Chips         Cheetos

In [430]:
pd.crosstab(df2["Product_ID"],df2["Product_ID"])

Product_ID  101  102  103  104  107  108
Product_ID
101           1    0    0    0    0    0
102           0    1    0    0    0    0
103           0    0    1    0    0    0
104           0    0    0    1    0    0
107           0    0    0    0    1    0
108           0    0    0    0    0    1

In [458]:
sales = {'Months': ['Jan','Feb','Mar','Apr','May','June','July','Aug','Sep','Oct','Nov','Dec'],
        'Sales': [22000,27000,25000,29000,35000,67000,78000,67000,56000,56000,89000,60000],
         'Seasons': ['Winter','Winter','Spring','Spring','Spring','Summer','Summer','Summer','Fall','Fall','Fall','Winter']
        }
df = pd.DataFrame(sales, columns= ['Months', 'Sales','Seasons'])
df

   Months  Sales Seasons
0     Jan  22000  Winter
1     Feb  27000  Winter
2     Mar  25000  Spring
3     Apr  29000  Spring
4     May  35000  Spring
5    June  67000  Summer
6    July  78000  Summer
7     Aug  67000  Summer
8     Sep  56000    Fall
9     Oct  56000    Fall
10    Nov  89000    Fall
11    Dec  60000  Winter

In [445]:
df=df.append(df)

In [459]:
df["Sales"].sum()

611000

In [470]:
pd.pivot_table(df,index=["Seasons"],values=["Sales"],aggfunc=sum)

          Sales
Seasons
Fall     201000
Spring    89000
Summer   212000
Winter   109000

In [471]:
df

   Months  Sales Seasons
0     Jan  22000  Winter
1     Feb  27000  Winter
2     Mar  25000  Spring
3     Apr  29000  Spring
4     May  35000  Spring
5    June  67000  Summer
6    July  78000  Summer
7     Aug  67000  Summer
8     Sep  56000    Fall
9     Oct  56000    Fall
10    Nov  89000    Fall
11    Dec  60000  Winter

In [473]:
df = pd.DataFrame({"a": [1,2,3,1,2,3], "b":[1,1,1,2,2,2], "c":np.random.rand(6)})

In [475]:
df

   a  b         c
0  1  1  0.204656
1  2  1  0.621213
2  3  1  0.522776
3  1  2  0.336968
4  2  2  0.894448
5  3  2  0.237519

In [477]:
pd.pivot_table(df, index=["a"], columns=["b"], values=["c"], aggfunc=np.sum)

          c
b         1         2
a
1  0.204656  0.336968
2  0.621213  0.894448
3  0.522776  0.237519

In [515]:
a={"kola":[1,2,2,4],
"kola2":[1,2,3,3],
  "amount":[12,3242,435,342]}

In [516]:
df=pd.DataFrame(a)

In [518]:
df

   kola  kola2  amount
0     1      1      12
1     2      2    3242
2     2      3     435
3     4      3     342

In [521]:
pd.pivot_table(df,index=["kola"],columns="kola2",values="amount")

kola2     1       2      3
kola
1      12.0     NaN    NaN
2       NaN  3242.0  435.0
4       NaN     NaN  342.0